# 请修改编辑器中的代码，接收用户输入的一个浮点数，输出这个浮点数的小数部分各字符的和。结果要求以10为宽度，靠右对齐，并使用星号 * 进行填充。

# 输入示例：
# 1234.5678

# 输出示例：
# ********26

# s = input("请输入一个小数: ")
# s = s[::-1]
# ____________
# for c in s:
#     if c == '.':
#         ____________
#     cs += eval(c)
# print('{____________}'.format(cs))

#######################################################################################################################################
n = input()
s = "〇一二三四五六七八九"
for c in "0123456789":
    n = n.replace(c, s[int(c) : int(c) + 1]) # n.replace(c, s[int(c)]
print(n)
