# 请修改编辑器中的代码，完成以下功能：获取用户输入的一个整数 n，输出一个包含 n-1 行的数字三角形阵列。该阵列的每一行是从该行的序号开始到 n-1 的整数序列，数字之间用英文空格分隔。

# 输入示例：
# 8

# 输出示例：
# 1 2 3 4 5 6 7
# 2 3 4 5 6 7
# 3 4 5 6 7
# 4 5 6 7
# 5 6 7
# 6 7
# 7

# n = eval(input("请输入一个整数："))
# for i in range(1,n):
#     for j in range(1,n):
#         if ______(1)_____________:
#             ______(2)___________
#     print()
#######################################################################################################################################

import random

random.seed(100)
s = 0
random_list = random.sample(range(1, 9 + 1), 3)
for i in random_list:
    s = s + i**3
print(s)
