# 请修改编辑器中的代码，用户输入一个数字作为种子，以26个小写字母和0~9数字为基础，随机生成10个8位密码，并将每个密码在单独一行打印输出。
# import random

# s = input("请输入随机种子: ")
# ls = []
# for i in range(26):
#     ls.append(chr(ord('a')+i))
# for i in range(10):
#     ls.append(chr(____________))
    
# random.seed(____________)
# for i in range(10):
#     for j in range(8):
#         print(____________,end='')
#     print()

#######################################################################################################################################

n = eval(input("请输入正整数:"))
print("{:=^14}".format(n))
