# 请修改编辑器中的代码，接收用户输入的一个小于20的正整数，在屏幕上逐行递增显示从01到该正整数。数字显示的宽度为2，不足位置补0，后面追加一个空格，然后显示>符号，>符号的个数等于行首数字。

# 输入示例：
# 3

# 输出示例：
# 01>
# 02>>
# 03>>>


# n = input('请输入一个正整数:')
# for i in range(____________):
#     print('____________'.format(i, ____________))
#######################################################################################################################################

import random

s = input("请输入随机种子: ")
ls = []
for i in range(26):
    ls.append(chr(ord("a") + i))
for i in range(10):
    ls.append(chr(ord("0") + i))

random.seed(s)
for i in range(10):
    for j in range(8):
        print(random.choice(ls), end="")
    print()
