# 请修改编辑器中的代码，完成以下功能：键盘输入正整数 n，按要求将 n 输出到屏幕。格式要求：宽度为25个字符，等号 = 填充，右对齐，带千位分隔符。如果输入正整数超过25位，则按照实际长度输出。

# 输入示例：
# 1234

# 输出示例：
# ====================1,234
# s = input()
# print("{_______(1)_________}".format(_______(2)_________))
#######################################################################################################################################

import random

n = eval(input())

random.seed(100)
for i in range(1, 11):
    if i < 10:
        print(random.randint(1, n), end=",")
    else:
        print(random.randint(1, n))
