# 请修改编辑器中的代码，完成以下功能：让用户输入一串由数字和字母混合组成的数据，统计其中数字和字母的个数，并在屏幕上显示。

# 输入示例：
# Fda243fdw3

# 输出示例：
# 数字个数：4，字母个数：6

# ns = input("请输入一串数据：")
# dnum,dchr = ____________
# for i in ns:
#     if i.isnumeric():
#         dnum += ____________
#     elif i.isalpha():
#         dchr += ____________
#     else:
#         pass
# print('数字个数：{}，字母个数：{}'.format(____________))

#######################################################################################################################################

s = input()
print("{:=>25,}".format(int(s)))
