# 请修改编辑器中的代码，完成如下功能：接收用户输入的一个大于10且小于108的十进制正整数，并输出该正整数各位数字的和，结果需要以25为宽度居中显示，并使用等号 `=` 进行填充。

# 输入示例：
# 1357

# 输出示例：
# ============16===========

# s = input("请输入一个正整数: ")
# ____________
# for c in s:
#     cs += ____________
# print('{____________}'.format(cs))

#######################################################################################################################################

import random

brandlist = ["华为", "苹果", "诺基亚", "OPPO", "小米"]
random.seed(0)
name = random.choice(brandlist)
print(name)
