# 请修改编辑器中的代码，完成以下功能：获取一个由英文逗号、字母、汉字、数字字符组成的输入，计算该输入中所有数字字符的和，并输出。

# 输入示例：
# 32,英特尔,ab,32,3,苹果

# 输出示例：
# 数字和是：67

# myinput = input("请输入：")
# ls = ______(1)___________
# s = 0
# for c in ls:
#     if c.strip(" ").isdigit():
#         ________(2)_______
# print("数字和是：" + str(s))

#######################################################################################################################################


s = input("请输入一个正整数: ")
cs = 0
for c in s:
    cs += int(c)
print("{:=^25}".format(cs))
