# 请修改编辑器中的代码，完成以下功能：用户按照列表格式输入数据，将用户输入的列表中属于字符串类型的元素连接成一个完整的字符串，并打印输出。

# 输入示例：
# [3,"让","我们", 98, "说中文"]

# 输出示例：
# 让我们说中文

# ls = eval(input())
# s = ""
# for item in ls:
#     if ___(1)_____ == type("香山"):
#         s += ___（2）_____
# print(s)

#######################################################################################################################################

myinput = input("请输入：")
ls = myinput.split(",")
s = 0
for c in ls:
    if c.strip(" ").isdigit():
        s += int(c)
print("数字和是：" + str(s))
