# 请修改编辑器中的代码，完成以下功能：以 25 为种子，随机生成一个1～100之间的整数，让用户来猜，用户最多可以猜6次。接收用户输入的数字，按以下规则判断：

# 如果输入的数字和随机数相同，则输出“恭喜你，猜对了!”，程序结束。
# 如果输入的数字小于随机数，则输出“小了，请再试试”，程序继续。
# 如果输入的数字大于随机数，则输出“大了，请再试试”，程序继续。
# 若6次还没猜对，在判断大小后输出“谢谢!请休息后再猜”，然后程序退出

# import random

# random.seed(25)
# n = ___________(1)____________
# for m in range(1,7):
#     x = eval(input("请输入猜测数字："))
#     if x == n:
#         print("恭喜你，猜对了！")
#         break
#     elif  ___________(2)___________:
#         print("大了，再试试")
#     else:
#         print("小了，再试试")
#     if ___________(3)___________:
#         print("谢谢！请休息后再猜")

#######################################################################################################################################

import jieba

txt = input("请输入一段中文文本:")
ls = jieba.lcut(txt)
for i in ls[::-1]:
    print(i, end="")
