# 请修改编辑器中的代码，完成以下功能：接收用户输入的一组以英文逗号分隔的整数或浮点数，打印输出这组数据中的最大值。

# 输入示例：
# 1.2,3.4,5.6,7.8,9.0

# 输出示例：
# 9.0

# s = input("请输入一组数据: ")
# ls = ____________
# lt = []
# for i in ls:
#     lt.append(____________)
# print(max(lt))

#######################################################################################################################################

import random

random.seed(25)
n = random.randint(1, 100)
for m in range(1, 7):
    x = eval(input("请输入猜测数字："))
    if x == n:
        print("恭喜你，猜对了！")
        break
    elif x > n:
        print("大了，再试试")
    else:
        print("小了，再试试")
    if x != n and m == 6:
        print("谢谢！请休息后再猜")
