# 请修改编辑器中的代码，完成以下功能：键盘输入一组人员的姓名、性别、年龄等信息，信息间采用空格分隔，每人一行，空行回车结束录入。程序计算并输出这组人员的平均年龄（保留2位小数）和其中男性人数。

# 输入示例：
# 张三 男 35
# 李四 男 21
# 王五 男 18

# 输出示例：
# 平均年龄是24.67
# 男性人数是3

# data = input()  # 姓名 年龄 性别
# ...  
# while data:
#     ...
#     data = input()
# ...
# print("平均年龄是{:.2f} 男性人数是{}".format(______))

#######################################################################################################################################

import random as r
r.seed(0)
persons = ['Aele', 'Bob','lala', 'baicai']
flag = 3
while flag>0:
    flag -= 1
    name = input('请输入一个名字：')
    if name == 'q':
        print('程序自动退出')
        break
    if name in persons:
        num = r.randint(1000, 9999)
        print('{} {}'.format(name, num))
    else:
        print('对不起，您输入的名字不存在。')