# 请修改编辑器中的代码，完成以下功能：使用 turtle 库绘制三个彩色的圆，圆的颜色按顺序从 color 列表中获取。圆的圆心位于 (0,0) 坐标处，半径从里至外分别是10像素、30像素、60像素。

# import turtle as t
# color = ['red','green','blue']
# rs = [10,30,60]

# for i in range(___(1)___):
#     t.penup()
#     t.goto(0, ___(2)___)
#     t. ___(3)___
#     t.pencolor(___(4)___)
#     t.circle(___(5)___)
# t.done()

#######################################################################################################################################

import turtle as t

for i in range(3):
    t.seth(i * 120)
    t.fd(200)