# 请修改编辑器中的代码，完成以下功能：给定两个一维列表 lt1 和 lt2，计算 lt1 列表与 lt2 列表的向量内积。向量内积计算公式为：
# K = x1*y1 + x2*y2 + x3*y3，其中每次计算包含两组对应元素的值及累计和。

# 输入示例：
# lt1 = [0.69, 0.292, 0.33, 0.131, 0.61, 0.254]
# lt2 = [0.1, 0.8, 0.2]

# 输出格式示例：
# k=0.069, filter[0]=0.100, img[0+0]=0.690
# k=0.303, filter[1]=0.800, img[0+1]=0.292
# k=0.369, filter[2]=0.200, img[0+2]=0.330

# img = [0.244, 0.832, 0.903, 0.145, 0.26, 0.452]
# filter = [0.1,0.8,0.1]
# res = []
# for i in range(len(img)-2):
#     ...
#     res.append(k)
# for r in res:
#     print('{:<10.3f}'.format(r),end = '')

#######################################################################################################################################

import random

random.seed(2)

pdict = {
    "Alice": ["123456789"],
    "Bob": ["234567891"],
    "Lily": ["345678912"],
    "Jane": ["456789123"],
}

name = input("请输入一个人名:")

if name in pdict:
    print(name, pdict[name][0], random.randint(1000, 9999))
else:
    print("对不起，您输入的用户信息不存在。")
