# 请修改编辑器中的代码，定义一个字符串 dela='-;:,.()"<>'，包含了需要去除的字符。获取用户输入的文本，去除字符串 dela 中的字符，使用 jieba 进行精准分词，并统计词语的个数。最后输出结果，格式如下：

# 输入示例：
# <<-就让我们忘了所有的哪些说过的话吧>>

# 输出示例：
# 里面有11个词语。

# import jieba
# dela = '-;:,.()"<>'
# s = input("请输入一句话:")
# print("\n这句话是:{}".format(____________))
# ……
# print("替换之后是:{}".format(____________))
# print("里面有 {}个词语。".format(____________))

#######################################################################################################################################

txt = input("请输入类型序列: ")
t = txt.split()
d = {}
for i in range(len(t)):
    d[t[i]] = d.get(t[i], 0) + 1
ls = list(d.items())
ls.sort(key=lambda x: x[1], reverse=True)  # 按照数量排序
for k in ls:
    print("{}:{}".format(k[0], k[1]))
