# 请修改编辑器中的代码，完成以下功能：
# 分别统计两个文本文件中出现次数最多的10个词语（要求词语不少于2个字符），并作为主题词输出。
# 输出格式要求：以英文冒号和英文逗号分隔，词语与标点之间不留空格，各词语之间用逗号分隔，最后一个词后不留逗号。
# 输出示例（词语为例子，非答案）：

# 2019:改革:10,企业:9,…(略),深化:2
# 2018:改革:11,效益:7,…(略),深化:1

# d = {}

# lt = list(d.items())
# lt.sort(key = lambda x:x[1],reverse = True)

#######################################################################################################################################

names = input("请输入各个同学行业名称，行业名称之间用空格间隔（回车结束输入）：")
s = names.split()
d = {}
for name in s:
    d[name] = d.get(name, 0) + 1
ls = list(d.items())
ls.sort(key=lambda x: x[1], reverse=True)  # 按照数量排序
for k in ls:
    print(k[0], k[1])
